logs/2014-11-10_11-04_cassandra_load-c1.out
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.CassandraCQLClient -s -p workload=com.yahoo.ycsb.workloads.CoreWorkload -p updateretrycount=1000 -p recordcount=10000 -p cassandra.readconsistencylevel=ONE -p exportmeasurementsinterval=30000 -p fieldcount=10 -p timeseries.granularity=100 -p threadcount=10 -p insertretrycount=10 -p readretrycount=1000 -p ignoreinserterrors=false -p reconnectionthroughput=10 -p hosts=54.171.209.23,54.171.213.53,54.171.105.34 -p operationcount=1666 -p maxexecutiontime=2400 -p cassandra.writeconsistencylevel=ONE -p measurementtype=timeseries -p reconnectiontime=1000 -p fieldlength=10 -p insertstart=0 -p insertcount=1666 -load
 0 sec: 0 operations; 
 2 sec: 0 operations; 
 4 sec: 0 operations; 
 6 sec: 0 operations; 
Connected to cluster: datalabs-cassandra
Datacenter: eu-west; Host: /172.31.27.106; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.105; Rack: 1b
Datacenter: eu-west; Host: /54.171.105.34; Rack: 1b
Connected to cluster: datalabs-cassandra
Datacenter: eu-west; Host: /172.31.27.105; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.106; Rack: 1b
Datacenter: eu-west; Host: /54.171.105.34; Rack: 1b
Connected to cluster: datalabs-cassandra
Datacenter: eu-west; Host: /172.31.27.105; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.106; Rack: 1b
Datacenter: eu-west; Host: /54.171.105.34; Rack: 1b
Connected to cluster: datalabs-cassandra
Datacenter: eu-west; Host: /172.31.27.106; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.105; Rack: 1b
Datacenter: eu-west; Host: /54.171.105.34; Rack: 1b
Connected to cluster: datalabs-cassandra
Datacenter: eu-west; Host: /172.31.27.105; Rack: 1b
Datacenter: eu-west; Host: /54.171.105.34; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.106; Rack: 1b
Connected to cluster: datalabs-cassandra
Datacenter: eu-west; Host: /54.171.105.34; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.105; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.106; Rack: 1b
Connected to cluster: datalabs-cassandra
Datacenter: eu-west; Host: /54.171.105.34; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.105; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.106; Rack: 1b
Connected to cluster: datalabs-cassandra
Datacenter: eu-west; Host: /172.31.27.106; Rack: 1b
Datacenter: eu-west; Host: /54.171.105.34; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.105; Rack: 1b
Connected to cluster: datalabs-cassandra
Datacenter: eu-west; Host: /172.31.27.105; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.106; Rack: 1b
Datacenter: eu-west; Host: /54.171.105.34; Rack: 1b
Connected to cluster: datalabs-cassandra
Datacenter: eu-west; Host: /172.31.27.106; Rack: 1b
Datacenter: eu-west; Host: /54.171.105.34; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.105; Rack: 1b
 8 sec: 0 operations; 
created keyspace ycsb
created keyspace ycsb
created keyspace ycsb
[...]
Executed create table if not exists ycsb.usertable (
     y_id varchar primary key,
      field0 blob,
      field1 blob,
      field2 blob,
      field3 blob,
      field4 blob,
      field5 blob,
      field6 blob,
      field7 blob,
      field8 blob,
      field9 blob);
 10 sec: 0 operations; 
created keyspace ycsb
created keyspace ycsb
Executed create table if not exists ycsb.usertable (
     y_id varchar primary key,
      field0 blob,
      field1 blob,
      field2 blob,
      field3 blob,
      field4 blob,
      field5 blob,
      field6 blob,
      field7 blob,
      field8 blob,
      field9 blob);
created keyspace ycsb
Executed create table if not exists ycsb.usertable (
     y_id varchar primary key,
      field0 blob,
      field1 blob,
      field2 blob,
      field3 blob,
      field4 blob,
      field5 blob,
      field6 blob,
      field7 blob,
      field8 blob,
      field9 blob);
 12 sec: 0 operations; 
Executed create table if not exists ycsb.usertable (
     y_id varchar primary key,
      field0 blob,
      field1 blob,
      field2 blob,
      field3 blob,
      field4 blob,
      field5 blob,
      field6 blob,
      field7 blob,
      field8 blob,
      field9 blob);
created keyspace ycsb
created keyspace ycsb
Executed create table if not exists ycsb.usertable (
     y_id varchar primary key,
      field0 blob,
      field1 blob,
      field2 blob,
      field3 blob,
      field4 blob,
      field5 blob,
      field6 blob,
      field7 blob,
      field8 blob,
      field9 blob);
Executed create table if not exists ycsb.usertable (
     y_id varchar primary key,
      field0 blob,
      field1 blob,
      field2 blob,
      field3 blob,
      field4 blob,
      field5 blob,
      field6 blob,
      field7 blob,
      field8 blob,
      field9 blob);
 14 sec: 0 operations; 
 16 sec: 0 operations; 
 18 sec: 0 operations; 
 20 sec: 0 operations; 
Executed create table if not exists ycsb.usertable (
     y_id varchar primary key,
      field0 blob,
      field1 blob,
      field2 blob,
      field3 blob,
      field4 blob,
      field5 blob,
      field6 blob,
      field7 blob,
      field8 blob,
      field9 blob);
 22 sec: 0 operations; 
 24 sec: 121 operations; 60.5 current ops/sec;  
 26 sec: 1109 operations; 493.75 current ops/sec;   
 26 sec: 1162 operations; 296.09 current ops/sec;   
[INSERT], 0, 5779.0, 340.0
[INSERT], 100, 8836.53125, 320.0
[INSERT], 200, 13548.54, 500.0
[INSERT], 300, 10257.557692307691, 520.0
[INSERT], 400, 22538.76, 250.0
[INSERT], 500, 29305.866666666665, 300.0
[INSERT], 600, 6940.578947368421, 760.0
[INSERT], 700, 6769.3448275862065, 290.0
[INSERT], 800, 30468.590909090908, 440.0
[INSERT], 900, 8744.531645569621, 790.0
[INSERT], 1000, 15815.36170212766, 470.0
[INSERT], 1100, 8278.117647058823, 850.0
[INSERT], 1200, 11226.174603174602, 630.0
[INSERT], 1300, 13342.363636363636, 440.0
[INSERT], 1400, 11866.045454545454, 660.0
[INSERT], 1500, 15978.260869565218, 460.0
[INSERT], 1600, 12149.672727272728, 550.0
[INSERT], 1700, 15486.666666666666, 420.0
[INSERT], 1800, 18175.86046511628, 430.0
[INSERT], 1900, 10337.454545454546, 330.0
[INSERT], 2000, 9700.353846153846, 650.0
[INSERT], 2100, 10620.068965517241, 290.0
[INSERT], 2200, 11348.325, 400.0
[INSERT], 2300, 7074.222222222223, 270.0
[CLEANUP], 0, 0.5, 20.0
[CLEANUP], 100, 0.0, 10.0
[CLEANUP], 300, 0.0, 20.0
[CLEANUP], 500, 0.0, 10.0
[INSERT], 2400, 6776.2692307692305, 260.0
[INSERT], Operations, 1162
[INSERT], Retries, 0
[INSERT], AverageLatency(us), 12348.003442340792
[INSERT], MinLatency(us), 1584
[INSERT], MaxLatency(us), 225400
[INSERT], Return=0, 1162
[CLEANUP], 600, 0.0, 10.0
[CLEANUP], Operations, 7
[CLEANUP], Retries, 0
[CLEANUP], AverageLatency(us), 0.14285714285714285
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 1
[OVERALL], Reconnections, 0.0
[OVERALL], RunTime(ms), 2295.0
[OVERALL], Operations, 1162.0
[OVERALL], Throughput(ops/sec), 506.318082788671
java -cp /home/ubuntu/ycsb/guava-17.0.jar:/opt/ycsb/core/lib/core-0.1.4.jar:/opt/ycsb/cassandra-binding/lib/cassandra-binding-0.1.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.CassandraCQLClient -s -p workload=com.yahoo.ycsb.workloads.CoreWorkload -p updateretrycount=1000 -p recordcount=10000 -p cassandra.readconsistencylevel=ONE -p exportmeasurementsinterval=30000 -p fieldcount=10 -p timeseries.granularity=100 -p threadcount=10 -p insertretrycount=10 -p readretrycount=1000 -p ignoreinserterrors=false -p reconnectionthroughput=10 -p hosts=54.171.209.23,54.171.213.53,54.171.105.34 -p operationcount=1666 -p maxexecutiontime=2400 -p cassandra.writeconsistencylevel=ONE -p measurementtype=timeseries -p reconnectiontime=1000 -p fieldlength=10 -p insertstart=0 -p insertcount=1666 -load